# ExportMullions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModelOptions..::..ExportMullions Property
EnergyAnalysisDetailModelOptions Class See Also
---
Indicates if to specify the setting for exporting mullions.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ExportMullions { get; set; }
```

Visual Basic
---
```text
Public Property ExportMullions As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportMullions {
	bool get ();
	void set (bool value);
}
```

# Remarks
When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical shading surface is produced from a mullion based on its centerline, thickness and offset.
# See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace